{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"e301f0f1-f1e8-513c-a751-9d7e17872e64","excerpt":"(WIP)\nWhen you build things on the web, you get to choose colors, which is incredible and fun, but can also be a huge challenge. Choosing colors shares two things with many other difficult decisions:\nthere are a  lot  of choices, and there’s no…","frontmatter":{"date":null,"path":"color","title":"Thinking about Color (WIP)"}}},{"node":{"id":"28f9aede-9142-5338-9054-c60a0fde7350","excerpt":"Sandspiel  is a falling sand game I built in the fall of 2018. If you haven’t played a falling sand game before, imagine a virtual chemistry kit. You’re given a painting palette of pixelated solids, liquids, and gasses, and it’s up to you to combine…","frontmatter":{"date":"January 06, 2019","path":"making-sandspiel","title":"Making Sandspiel (wip dont share pls)"}}},{"node":{"id":"c838077c-3605-5576-a7b3-4628864594e5","excerpt":"Sandspiel  is a falling sand game I built in the fall of 2018. If you haven’t played a falling sand game before, imagine a virtual chemistry kit. You’re given a painting palette of pixelated solids, liquids, and gasses, and it’s up to you to combine…","frontmatter":{"date":"January 06, 2019","path":"making-sandspiel","title":"Making Sandspiel (wip dont share pls)"}}},{"node":{"id":"c1577933-4d65-50c7-a240-06db240e9381","excerpt":"Code reviews are an important part of bringing people’s minds together to build working software. Not only do they allow one person’s experience and perspective to augment another’s blind spots, but they also aide in sharing information and building…","frontmatter":{"date":"January 05, 2018","path":"code-review","title":"How to Review Code You Don't Understand"}}},{"node":{"id":"88798654-94b4-52b2-bf71-a848275924c6","excerpt":"“Computer Art” is an oxymoron. Not to say that computers don’t have their own beauty, or that wonderful, important, heartbreaking art hasn’t been made with, by, or about the lovable thinking rocks - It’s just that there is a fundamental aspect of…","frontmatter":{"date":"December 07, 2017","path":"rc-art-pop-up-impedance","title":"RC Pop-up - Impedance"}}},{"node":{"id":"d81e2fcf-01e3-5813-ba2e-61b19c4efbc6","excerpt":"“The idea is the machine that makes the work of art” - Sol LeWitt Sol LeWitt’s  Wall Drawing  series are works that are defined as simple sets of instructions, and drawn directly onto walls. Because they are constructed algorithmically according to…","frontmatter":{"date":"December 06, 2017","path":"rc-art-pop-up-wall-drawing","title":"RC Pop-up Day 2 - Wall Drawings"}}},{"node":{"id":"3d29df17-8f47-589a-9211-2b693c066d03","excerpt":"“In the end, we self-perceiving, self-inventing, locked-in mirages are little miracles of self-reference.” - Douglas R. Hofstadter Having written a variety of fragment shaders over the last year, one thing that influenced my exploration was the…","frontmatter":{"date":"December 05, 2017","path":"rc-art-pop-up-webcams","title":"RC Pop-up Day 1 - Webcam Feedback"}}},{"node":{"id":"18950f7b-d222-599c-b96a-7a96c09e3819","excerpt":"“There are many side-effects that the artist cannot imagine. These may be used as ideas for new works.” - Sol Lewitt, 1969 I’m in Berlin for the first time in my life! Compared to North America, the pigeons look the same, but the crows look different…","frontmatter":{"date":"December 04, 2017","path":"rc-art-pop-up","title":"Recurse Center Berlin Pop-up"}}},{"node":{"id":"4b7dc5a6-18d1-540c-b5be-e5a72cd15cc9","excerpt":"Any public place where programmers are allowed to comment on hyperlinks will be about 15% page design critique. Making good webpages is a hard design task. The requirements are sometimes competing and often invisible to you as the designer. Finding a…","frontmatter":{"date":"November 24, 2017","path":"user-styles","title":"Make Yourself Comfortable with Custom Styling"}}},{"node":{"id":"d006bc33-3bc1-528f-a589-42e37fe49212","excerpt":"“If I were going to give you a quick summary of what our codebase is like, I’d say it’s procedural code that manipulates maps.” - Fourteen Months with Clojure  by Dan McKinley Maps or  “Associative arrays”  are a ubiquitous abstraction in software…","frontmatter":{"date":"October 31, 2017","path":"merging-maps","title":"Merging Maps"}}},{"node":{"id":"4f481f13-9259-5ad2-85dc-1699be1f1ff4","excerpt":"“I like to work fast. I despise not having the right tool or, worse, knowing I have it but not being able to find it. It’s a pointless delay that wrecks my pace—and mood.” ^[ Inside Adam Savage’s Toolbox  by Adam Savage] “First Order Retrievability…","frontmatter":{"date":"September 30, 2017","path":"first-order-retrievability","title":"First Order Retrievability with Hammerspoon"}}}]}},"pageContext":{}}